[{"vio_code":"","vio_des":""},{"vio_code":"02A","vio_des":"Food not cooked to required minimum temperature."},{"vio_code":"02B","vio_des":"Hot food item not held at or above 140º F."},{"vio_code":"02C","vio_des":"Hot food item that has been cooked and refrigerated is being held for service without first being reheated to 1 65º F or above within 2 hours."},{"vio_code":"02D","vio_des":"Precooked potentially hazardous food from commercial food processing establishment that is supposed to be heated, but is not heated to 140º F within 2 hours."},{"vio_code":"02E","vio_des":"Whole frozen poultry or poultry breasts, other than a single portion, is being cooked frozen or partially thawed."},{"vio_code":"02F","vio_des":"Meat, fish or molluscan shellfish served raw or undercooked without prior notification to customer."},{"vio_code":"02G","vio_des":"Cold food item held above 41º F (smoked fish and reduced oxygen packaged foods above 38 ºF) except during necessary preparation."},{"vio_code":"02H","vio_des":"Food not cooled by an approved method whereby the internal product temperature is reduced from 140º F to 70º F or less within 2 hours, and from 70º F to 41º F or less within 4 additional hours."},{"vio_code":"02I","vio_des":"Food prepared from ingredients at ambient temperature not cooled to 41º F or below within 4 hours."},{"vio_code":"02J","vio_des":"Reduced oxygen packaged (ROP) foods not cooled by an approved method whereby the internal food temperature is reduced to 38º F within two hours of cooking and if necessary further cooled to a temperature of 34º F within six hours of reaching 38º F."},{"vio_code":"03A","vio_des":"Food from unapproved or unknown source or home canned. Reduced oxygen packaged (ROP) fish not frozen before processing; or ROP foods prepared on premises transported to another site."},{"vio_code":"03B","vio_des":"Shellfish not from approved source, improperly tagged/labeled; tags not retained for 90 days."},{"vio_code":"03C","vio_des":"Eggs found dirty/cracked; liquid, frozen or powdered eggs not pasteurized."},{"vio_code":"03D","vio_des":"Canned food product observed swollen, leaking or rusted, and not segregated from other consumable food items ."},{"vio_code":"03E","vio_des":"Potable water supply inadequate. Water or ice not potable or from unapproved source.  Cross connection in potable water supply system observed."},{"vio_code":"03F","vio_des":"Unpasteurized milk or milk product present."},{"vio_code":"03G","vio_des":"Raw food not properly washed prior to serving."},{"vio_code":"04A","vio_des":"Food Protection Certificate not held by supervisor of food operations."},{"vio_code":"04B","vio_des":"Food worker prepares food or handles utensil when ill with a disease transmissible by food, or have exposed infected cut or burn on hand."},{"vio_code":"04C","vio_des":"Food worker does not use proper utensil to eliminate bare hand contact with food that will not receive adequate additional heat treatment."},{"vio_code":"04D","vio_des":"Food worker does not wash hands thoroughly after using the toilet, coughing, sneezing, smoking, eating, preparing raw foods or otherwise contaminating hands."},{"vio_code":"04E","vio_des":"Toxic chemical improperly labeled, stored or used such that food contamination may occur."},{"vio_code":"04F","vio_des":"Food, food preparation area, food storage area, area used by employees or patrons, contaminated by sewage or liquid waste."},{"vio_code":"04G","vio_des":"Unprotected potentially hazardous food re-served."},{"vio_code":"04H","vio_des":"Raw, cooked or prepared food is adulterated, contaminated, cross-contaminated, or not discarded in accordance with HACCP plan."},{"vio_code":"04I","vio_des":"Unprotected food re-served."},{"vio_code":"04J","vio_des":"Appropriately scaled metal stem-type thermometer or thermocouple not provided or used to evaluate temperatures of potentially hazardous foods during cooking, cooling, reheating and holding."},{"vio_code":"04K","vio_des":"Evidence of rats or live rats present in facility's food and/or non-food areas."},{"vio_code":"04L","vio_des":"Evidence of mice or live mice present in facility's food and/or non-food areas."},{"vio_code":"04M","vio_des":"Live roaches present in facility's food and/or non-food areas."},{"vio_code":"04N","vio_des":"Filth flies or food/refuse/sewage-associated (FRSA) flies present in facility\u001as food and/or non-food areas. Filth flies include house flies, little house flies, blow flies, bottle flies and flesh flies. Food/refuse/sewage-associated flies include fruit flies, drain flies and Phorid flies."},{"vio_code":"04O","vio_des":"Live animals other than fish in tank or service animal present in facility's food and/or non-food areas."},{"vio_code":"05A","vio_des":"Sewage disposal system improper or unapproved."},{"vio_code":"05B","vio_des":"Harmful, noxious gas or vapor detected. CO ~1 3 ppm."},{"vio_code":"05C","vio_des":"Food contact surface improperly constructed or located. Unacceptable material used."},{"vio_code":"05D","vio_des":"Hand washing facility not provided in or near food preparation area and toilet room. Hot and cold running water at adequate pressure to enable cleanliness of employees not provided at facility. Soap and an acceptable hand-drying device not provided."},{"vio_code":"05E","vio_des":"Toilet facility not provided for employees or for patrons when required."},{"vio_code":"05F","vio_des":"Insufficient or no refrigerated or hot holding equipment to keep potentially hazardous foods at required temperatures."},{"vio_code":"05H","vio_des":"No facilities available to wash, rinse and sanitize utensils and/or equipment."},{"vio_code":"05I","vio_des":"Refrigeration used to implement HACCP plan not equipped with an electronic system that continuously monitors time and temperature."},{"vio_code":"06A","vio_des":"Personal cleanliness inadequate. Outer garment soiled with possible contaminant.  Effective hair restraint not worn in an area where food is prepared."},{"vio_code":"06B","vio_des":"Tobacco use, eating, or drinking from open container in food preparation, food storage or dishwashing area observed."},{"vio_code":"06C","vio_des":"Food not protected from potential source of contamination during storage, preparation, transportation, display or service."},{"vio_code":"06D","vio_des":"Food contact surface not properly washed, rinsed and sanitized after each use and following any activity when contamination may have occurred."},{"vio_code":"06E","vio_des":"Sanitized equipment or utensil, including in-use food dispensing utensil, improperly used or stored."},{"vio_code":"06F","vio_des":"Wiping cloths soiled or not stored in sanitizing solution."},{"vio_code":"06G","vio_des":"HACCP plan not approved or approved HACCP plan not maintained on premises."},{"vio_code":"06H","vio_des":"Records and logs not maintained to demonstrate that HACCP plan has been properly implemented."},{"vio_code":"06I","vio_des":"Food not labeled in accordance with HACCP plan."},{"vio_code":"07A","vio_des":"Duties of an officer of the Department interfered with or obstructed."},{"vio_code":"08A","vio_des":"Facility not vermin proof. Harborage or conditions conducive to attracting vermin to the premises and/or allowing vermin to exist."},{"vio_code":"08B","vio_des":"Covered garbage receptacle not provided or inadequate, except that garbage receptacle may be uncovered during active use. Garbage storage area not properly constructed or maintained; grinder or compactor dirty."},{"vio_code":"08C","vio_des":"Pesticide use not in accordance with label or applicable laws. Prohibited chemical used/stored. Open bait station used."},{"vio_code":"09A","vio_des":"Canned food product observed dented and not segregated from other consumable food items."},{"vio_code":"09B","vio_des":"Thawing procedures improper."},{"vio_code":"09C","vio_des":"Food contact surface not properly maintained."},{"vio_code":"10A","vio_des":"Toilet facility not maintained and provided with toilet paper, waste receptacle and self-closing door."},{"vio_code":"10B","vio_des":"Plumbing not properly installed or maintained; anti-siphonage or backflow prevention device not provided where required; equipment or floor not properly drained; sewage disposal system in disrepair or not functioning properly."},{"vio_code":"10C","vio_des":"Lighting inadequate; permanent lighting not provided in food preparation areas, ware washing areas, and storage rooms."},{"vio_code":"10D","vio_des":"Mechanical or natural ventilation system not provided, improperly installed, in disrepair and/or fails to prevent excessive build-up of grease, heat, steam condensation vapors, odors, smoke, and fumes."},{"vio_code":"10E","vio_des":"Accurate thermometer not provided in refrigerated or hot holding equipment."},{"vio_code":"10F","vio_des":"Non-food contact surface improperly constructed. Unacceptable material used. Non-food contact surface or equipment improperly maintained and/or not properly sealed, raised, spaced or movable to allow accessibility for cleaning on all sides, above and underneath the unit."},{"vio_code":"10G","vio_des":"Food service operation occurring in room used as living or sleeping quarters."},{"vio_code":"10H","vio_des":"Proper sanitization not provided for utensil ware washing operation."},{"vio_code":"10I","vio_des":"Single service item reused, improperly stored, dispensed; not used when required."},{"vio_code":"10J","vio_des":"''''Wash hands\u001a sign not posted at hand wash facility."},{"vio_code":"15E","vio_des":"Out-of package sale of tobacco products observed."},{"vio_code":"15H","vio_des":"Sign prohibiting sale of tobacco products to minors not conspicuously posted."},{"vio_code":"15I","vio_des":"''''No Smoking\u001a and/or 'Smoking Permitted\u001a sign not conspicuously posted. Health warning not present on 'Smoking Permitted"},{"vio_code":"15J","vio_des":"Ashtray present in smoke-free area."},{"vio_code":"15K","vio_des":"Operator failed to make good faith effort to inform smokers of the Smoke-free Act prohibition of smoking."},{"vio_code":"15L","vio_des":"Smoke free workplace smoking policy inadequate, not posted, not provided to employees."},{"vio_code":"15S","vio_des":"Flavored tobacco products sold or offered for sale."},{"vio_code":"15T","vio_des":"Original label for tobacco products sold or offered for sale."},{"vio_code":"16A","vio_des":"A food containing artificial trans fat, with 0.5 grams or more of trans fat per serving, is being stored, distributed, held for service, used in preparation of a menu item, or served."},{"vio_code":"16B","vio_des":"The original nutritional fact labels and/or ingredient label for a cooking oil, shortening or margarine or food item sold in bulk, or acceptable manufacturer\u001as documentation not maintained on site."},{"vio_code":"16C","vio_des":"Caloric content not posted on menus, menu boards or food tags, in a food service establishment that is 1 of 15 or more outlets operating the same type of business nationally under common ownership or control, or as a franchise or doing business under the same name, for each menu item that is served in portions, the size and content of which are standardized."},{"vio_code":"16E","vio_des":"Caloric content range (minimum to maximum) not posted on menus and or menu boards for each flavor, variety and size of each menu item that is offered for sale in different flavors, varieties and sizes."},{"vio_code":"16F","vio_des":"Specific caloric content or range thereof not posted on menus, menu boards or food tags for each menu item offered as a combination meal with multiple options that are listed as single items."},{"vio_code":"18B","vio_des":"Document issued by the Board of Health, Commissioner or Department unlawfully reproduced or altered."},{"vio_code":"18C","vio_des":"Notice of the Department of Board of Health mutilated, obstructed, or removed."},{"vio_code":"18D","vio_des":"Failure to comply with an Order of the Board of Health, Commissioner, or Department."},{"vio_code":"18F","vio_des":"Permit not conspicuously displayed."},{"vio_code":"20A","vio_des":"Food allergy information poster not conspicuously posted where food is being prepared or processed by food workers."},{"vio_code":"20B","vio_des":"Food allergy information poster not posted in language understood by all food workers."},{"vio_code":"20D","vio_des":"Choking first aid\u001a poster not posted. \u001aAlcohol and pregnancy\u001a warning sign not posted. Resuscitation equipment: exhaled air resuscitation masks (adult & pediatric), latex gloves, sign not posted. Inspection report sign not posted."},{"vio_code":"20E","vio_des":"Letter Grade or Grade Pending card not conspicuously posted and visible to passersby."},{"vio_code":"20F","vio_des":"Current letter grade card not posted."},{"vio_code":"22A","vio_des":"Nuisance created or allowed to exist. Facility not free from unsafe, hazardous, offensive or annoying conditions."},{"vio_code":"22B","vio_des":"Toilet facility used by women does not have at least one covered garbage receptacle."},{"vio_code":"22C","vio_des":"Bulb not shielded or shatterproof, in areas where there is extreme heat, temperature changes, or where accidental contact may occur."},{"vio_code":"22E","vio_des":"ROP processing equipment not approved by DOHMH."},{"vio_code":"22F","vio_des":""},{"vio_code":"22G","vio_des":""}]